Project/Toir/src/Catalogs/ВложенныеАтрибутыКласса/ВложенныеАтрибутыКласса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВложенныеАтрибутыКласса</name>
  <attributes>
    <name>Источник</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.АтрибутыКласса</types>
      <types>CatalogRef.ВложенныеАтрибутыКласса</types>
    </type>
  </attributes>
  <attributes>
    <name>АтрибутКласса</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.АтрибутыКласса</types>
      <types>EnumRef.РеквизитыКлассаНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/Catalogs/ВложенныеАтрибутыКласса/ManagerModule.bsl
Функция ПолучитьВложенныйАтрибут(Источник, АтрибутКласса) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Источник", Источник);
	Запрос.УстановитьПараметр("АтрибутКласса", АтрибутКласса);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВложенныеАтрибутыКласса.Ссылка
		|ИЗ
		|	Справочник.ВложенныеАтрибутыКласса КАК ВложенныеАтрибутыКласса
		|ГДЕ
		|	ВложенныеАтрибутыКласса.Источник = &Источник
		|	И ВложенныеАтрибутыКласса.АтрибутКласса = &АтрибутКласса
		|	И НЕ ВложенныеАтрибутыКласса.ПометкаУдаления";
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		ВложенныйАтрибут = Результат.Ссылка;
	Иначе
		СпрОбъект = Справочники.ВложенныеАтрибутыКласса.СоздатьЭлемент();
		СпрОбъект.Источник = Источник;
		СпрОбъект.АтрибутКласса = АтрибутКласса;
		СпрОбъект.Наименование = Строка(АтрибутКласса);
		СпрОбъект.Записать();
		ВложенныйАтрибут = СпрОбъект.Ссылка;
	КонецЕсли;
	
	Возврат ВложенныйАтрибут;
	
КонецФункции

Функция ПрочитатьЗначенияВложенныхАтрибутов(СоответствиеОбъектов, 
		МассивКлассовДляЧтения, МассивНоменклатурыДляЧтения, МассивВложенныхАтрибутов) Экспорт
	
	ДанныеВложенныхАтрибутов = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначенияРеквизитовОбъектов(
		МассивВложенныхАтрибутов, "Источник, АтрибутКласса");
		
	ОбъектыДляЧтенияРеквизитов = Новый Соответствие;
	Для Каждого КлючИЗначение ИЗ ДанныеВложенныхАтрибутов Цикл
		Если ТипЗнч(КлючИЗначение.Значение.АтрибутКласса) = Тип("ПеречислениеСсылка.РеквизитыКлассаНоменклатуры") Тогда
			ОбъектДляЧтения = СоответствиеОбъектов[КлючИЗначение.Значение.Источник];
			Если НЕ ОбъектДляЧтения = Неопределено Тогда
				ТипОбъекта = ТипЗнч(ОбъектДляЧтения);
				ДанныеДляЧтения = ОбъектыДляЧтенияРеквизитов[ТипОбъекта];
				Если ДанныеДляЧтения = Неопределено Тогда
					ДанныеДляЧтения = Новый Структура("МассивОбъектов, МассивРеквизитов, ВложенныеРеквизиты, СписокРеквизитов", 
						Новый Массив, Новый Массив, Новый Соответствие, "");
					ОбъектыДляЧтенияРеквизитов.Вставить(ТипОбъекта, ДанныеДляЧтения);
				КонецЕсли;
				
				ДанныеДляЧтения.МассивОбъектов.Добавить(ОбъектДляЧтения);
				
				АтрибутКласса = КлючИЗначение.Значение.АтрибутКласса;
				МетаданныеСпр = Метаданные.НайтиПоТипу(ТипОбъекта);
				МетаданныеРеквизита = Перечисления.РеквизитыКлассаНоменклатуры.ПолучитьМетаданныеРеквизита(
					МетаданныеСпр, АтрибутКласса);
				
				Если ДанныеДляЧтения.МассивРеквизитов.Найти(АтрибутКласса) = Неопределено Тогда
					ДанныеДляЧтения.МассивРеквизитов.Добавить(АтрибутКласса);
					Если НЕ МетаданныеРеквизита = Неопределено Тогда
						ДанныеДляЧтения.СписокРеквизитов = ДанныеДляЧтения.СписокРеквизитов 
							+ ?(ПустаяСтрока(ДанныеДляЧтения.СписокРеквизитов), "", ", ") + МетаданныеРеквизита.Имя;
					КонецЕсли;
				КонецЕсли;
				
				ДанныеДляЧтения.ВложенныеРеквизиты.Вставить(КлючИЗначение.Ключ, 
					Новый Структура("ОбъектДляЧтения, ИмяРеквизита", ОбъектДляЧтения, МетаданныеРеквизита.Имя));
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если МассивКлассовДляЧтения.Количество() > 0 Тогда
		ТаблицаРодителей = Справочники.Классы.ПолучитьТаблицуРодителей(МассивКлассовДляЧтения);
		ТаблицаВложенныхАтрибутов = Справочники.Классы.ПолучитьТаблицуАтрибутов(ТаблицаРодителей, , Ложь);
	КонецЕсли;
	
	Если МассивНоменклатурыДляЧтения.Количество() > 0 Тогда
		ТаблицаВложенныхАтрибутовНоменклатуры = Справочники.НоменклатураКласса.ПолучитьТаблицуАтрибутов(
			МассивНоменклатурыДляЧтения,,, Ложь);
		Если ТаблицаВложенныхАтрибутов = Неопределено Тогда
			ТаблицаВложенныхАтрибутов = ТаблицаВложенныхАтрибутовНоменклатуры;
		Иначе
			ТипКолонки = Новый ОписаниеТипов(
				ТаблицаВложенныхАтрибутов.Колонки.Объект.ТипЗначения, "СправочникСсылка.НоменклатураКласса");
			ТаблицаВложенныхАтрибутов.Колонки.Объект.Имя = "ОбъектУдалить";
			ТаблицаВложенныхАтрибутов.Колонки.Добавить("Объект", ТипКолонки);
			ЗначенияКолонки = ТаблицаВложенныхАтрибутов.ВыгрузитьКолонку("ОбъектУдалить");
			ТаблицаВложенныхАтрибутов.ЗагрузитьКолонку(ЗначенияКолонки, "Объект");
			
			Для Каждого СтрокаЗначений ИЗ ТаблицаВложенныхАтрибутовНоменклатуры Цикл
				НоваяСтрока = ТаблицаВложенныхАтрибутов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗначений);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
		
	СоответствиеРезультат = Новый Соответствие;
	
	Если ОбъектыДляЧтенияРеквизитов.Количество() > 0 Тогда
		
		Для Каждого КлючИЗначение ИЗ ОбъектыДляЧтенияРеквизитов Цикл
			Если ПустаяСтрока(КлючИЗначение.Значение.СписокРеквизитов) Тогда
				Продолжить;
			КонецЕсли;
			
			МетаданныеСпр = Метаданные.НайтиПоТипу(КлючИЗначение.Ключ);
			ЗначенияРеквизитов = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначенияРеквизитовОбъектов(
				КлючИЗначение.Значение.МассивОбъектов, КлючИЗначение.Значение.СписокРеквизитов);
				
			Для Каждого КлючИЗначениеВложенныхРеквизитов ИЗ КлючИЗначение.Значение.ВложенныеРеквизиты Цикл
				ЗначенияОбъекта = ЗначенияРеквизитов[КлючИЗначениеВложенныхРеквизитов.Значение.ОбъектДляЧтения];
				Если НЕ ЗначенияОбъекта = Неопределено Тогда
					ЗначениеРеквизита = ЗначенияОбъекта[КлючИЗначениеВложенныхРеквизитов.Значение.ИмяРеквизита];
					СоответствиеРезультат.Вставить(КлючИЗначениеВложенныхРеквизитов.Ключ, ЗначениеРеквизита);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
		
	Если НЕ ТаблицаВложенныхАтрибутов = Неопределено Тогда
		СтруктураПоиска = Новый Структура("Объект, АтрибутКласса");
		Для Каждого КлючИЗначение ИЗ ДанныеВложенныхАтрибутов Цикл
			ОбъектДляЧтения = СоответствиеОбъектов[КлючИЗначение.Значение.Источник];
			Если НЕ ОбъектДляЧтения = Неопределено Тогда
				СтруктураПоиска.Объект = ОбъектДляЧтения;
				СтруктураПоиска.АтрибутКласса = КлючИЗначение.Значение.АтрибутКласса;
				Найдено = ТаблицаВложенныхАтрибутов.НайтиСтроки(СтруктураПоиска);
				Если Найдено.Количество() > 0 Тогда
					СоответствиеРезультат.Вставить(КлючИЗначение.Ключ, Найдено[0].ЗначениеАтрибутаКласса);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СоответствиеРезультат;
	
КонецФункции
